_posts/2020-07-20-weekly-report.md
- [20200713-20200720一周总结](#org8834faf)
- [工作](#org4e249e0)
- [节拍器](#orgc537cc2)
- [rss服务](#orgb722e15)
- [portage重写](#org0207c3e)
- [爵士学习](#org1983dd1)
- [sys-admin](#org30a9724)
- [下周展望](#orgc42cc05)



<a id="org8834faf"></a>

# 20200713-20200720一周总结

这周过的非常充实，上班的时候填了很多以前的坑。

音乐学习做了一些作业，但是实在是没有这个精力去完成最难的那部分了，感觉自己有点废的迹象。

这周开始放暑假了，所以画画课可能要等到暑假结束再开始，正好，不然周末有点太累了。

剧本杀也挺有意思


<a id="org4e249e0"></a>

# 工作

之前写的几个小服务都有坑，基本不太能用，一周完全填了，非常幸福。


<a id="orgc537cc2"></a>

# 节拍器

由于对emacs的熟悉，环境一下就搭好了，当然vs code什么的可能更快，开始了简单的界面编写。 感觉这个流程是简单界面写写，然后写写数据保存什么的，然后写逻辑，最后改界面，然后提取一个包出来，当然这是理想情况。 感觉安卓写起来还挺快，可能要买个mac写代码打包安卓了，说不定是下周买。


<a id="orgb722e15"></a>

# rss服务

这个环境rbenv有点问题


<a id="org0207c3e"></a>

# portage重写

基本把emerge的东西用go语法改了，剩下的要开始动它的一些生命周期这种垃圾东西了，讨厌python。


<a id="org1983dd1"></a>

# 爵士学习

工作日做了作业，周末完全摸鱼。学期结束了，开心。


<a id="org30a9724"></a>

# sys-admin

买的aws又贵又卡，换了个linode，还用了terraform，太容易了。


<a id="orgc42cc05"></a>

# 下周展望

把ldap的环境配置好 看看org-journal用一用，不然org学了没用，但是其实也不太好用 总觉得年底能出点东西，爵士学完了，画画可能也学完了，手头的垃圾小东西也写完了，portago也重新能跑了。
